In [1]:
import numpy as np
from scipy.sparse import csr_matrix
import pandas as pd

In [2]:
arr = np.matrix([[0, 0, 0, 0, 0, 1, 1, 0, 2]]) # works with arrays too

sparse_matrix = csr_matrix(arr)

print(arr)
print(sparse_matrix)
print(sparse_matrix.data)
print(sparse_matrix.count_nonzero())

[[0 0 0 0 0 1 1 0 2]]
  (0, 5)	1
  (0, 6)	1
  (0, 8)	2
[1 1 2]
3

In [3]:
df = pd.DataFrame(
    {
        'sport': ['bowling', 'football', 'hockey', 'hockey'],
        'year': [2000, 2001, 2001, 2003],
        'goals': [10, 20, 30, 40],
    }
)

test=df.pivot(index='sport', columns='year', values='goals').fillna(0) # damn, thats cool
display(df, test)

      sport  year  goals
0   bowling  2000     10
1  football  2001     20
2    hockey  2001     30
3    hockey  2003     40

year      2000  2001  2003
sport
bowling   10.0   0.0   0.0
football   0.0  20.0   0.0
hockey     0.0  30.0  40.0

In [4]:
df.loc[df['sport'] == 'bowling']

     sport  year  goals
0  bowling  2000     10

In [5]:
df.groupby(['year']).size()

year
2000    1
2001    2
2003    1
dtype: int64

In [6]:
#df[df['year'].isin([2001, 2000])]

f = [df.loc[df['year'] == i] for i in [2001, 2000]]
pd.concat([f[0], f[1]])

      sport  year  goals
1  football  2001     20
2    hockey  2001     30
0   bowling  2000     10

In [7]:
df

      sport  year  goals
0   bowling  2000     10
1  football  2001     20
2    hockey  2001     30
3    hockey  2003     40

In [8]:
test = df.groupby(['year'])['goals'].sum(numeric_only=True)
test

year
2000    10
2001    50
2003    40
Name: goals, dtype: int64

In [9]:
test = df.groupby(['year'])['goals'].mean()
test

year
2000    10.0
2001    25.0
2003    40.0
Name: goals, dtype: float64

In [10]:
test = df.groupby('year').size()

f = df.drop(df[df['year'].isin(test[test > 1].index)].index)
f

     sport  year  goals
0  bowling  2000     10
3   hockey  2003     40

In [11]:
df

      sport  year  goals
0   bowling  2000     10
1  football  2001     20
2    hockey  2001     30
3    hockey  2003     40

In [19]:
df = pd.DataFrame(
    {
        'userId': [1, 2, 3, 4, 5, 6],
        'movieId': [1, 1, 2, 3, 4],
        'rating': [1.0, 1.0, 2.0, 3.0, 4.0],
    }
)

df

  userId  movieId  rating
0      1        1     1.0
1      1        1     1.0
2      1        2     2.0
3      3        3     3.0
4      4        4     4.0

In [23]:
test = df.groupby('movieId').head(1)
#test = test.droplevel(level=0)
test

Empty DataFrame
Columns: [userId, movieId, rating]
Index: []